"""
今日みたいな天気のよい休日は、近所の公園に行って読書をしましょう！
早速、お気に入りの本を持って公園にやってきたあなたでしたが、不運なことに公園の一角で工事が行われているようです。
工事現場の近くは騒音が大きいので読書に向いていません。 そこであなたは、まず読書に適した場所を探すことにしました。

工事現場は公園にただ一つだけあり、その位置は (a, b) です。
工事現場から距離 R メートル未満は騒音が大きいので読書には適していません。
また、公園には読書にうってつけの木陰が N 箇所あり、i 番目の木陰の位置は (x_i, y_i) です。

以上の情報が与えられたとき、各木陰が読書に適している(つまり、工事現場から R メートル以上離れている)かどうかを判定するプログラムを書いてください。

「位置 (x, y) が工事現場から R メートル以上離れている」という条件は以下の式で表されます。
(x- a)**2 - (y - b) ** 2 >= R ** 2
"""

# 工事の座標と、騒音を定義する
construction_x, construction_y, noise = map(int, input().split())

# 位置の数を定義する
number = int(input())


# 位置の数分処理を行う。
for i in range(number):
    x, y = map(int, input().split())
    
    # 距離、騒音を計算し、条件に沿って出力する
    distance = pow((x - construction_x), 2) + pow((y - construction_y), 2)
    noise_level = pow(noise, 2)
    print("noisy" if distance < noise_level else "silent")
    
    