"""
あなたは運悪く病気にかかってしまい入院しなくてはいけなくなりました。
しかし、嫌いな数字があり、その数字が含まれる部屋番号の病室に入ると治療が
うまく行かないのでは無いかと不安になってしまいます…。

そこで、部屋番号のどの桁にも嫌いな数字が含まれていない病室をリストアップして
入院先に伝えることにしました。

・1行目に嫌いな数字 n (0から9までの1桁の数字)
・2行目に病室の総数 m
・3行目以降に各病室の部屋番号を表す整数 r_i (1 <= i <= m)

が改行区切りで与えられるので、希望する病室の部屋番号をすべて改行区切りで出力して下さい。

もし、希望する病室が1つもない場合は"none" と出力して下さい。
"""

# 嫌いの数字と部屋の数を定義する
dislike = input()
room = int(input())


allow = []# 使える部屋

# 部屋の数だけ、処理を繰り返す
for i in range(room):
    room_number = input()
    
    # if 条件 not in 対象で対象に条件が含まれていない時に処理できる。
    if dislike not in room_number: 
        allow.append(room_number)
 
        
# 使える部屋があるとき、1行ずつ出力する
if len(allow) > 0:
    for j in range(len(allow)):
        print(allow[j])
else:
    print("none")
