"""
今は月末。そろそろ今月の家計簿をつけないといけません。 
あなたの手元には、とあるスーパーマーケットのレシートの山があります。

スーパーマーケットにはポイントカードが導入されていて、
買い物をするたびに購入金額に応じたポイントがたまります。 
加算されるポイントは次の 3 つのルールに従って決定されます。

1. 通常は購入金額の 1 ％（小数点以下切り捨て）とする
2. ただし、3 のつく日は購入金額の 3 ％（小数点以下切り捨て）とする
3. ただし、5 のつく日は購入金額の 5 ％（小数点以下切り捨て）とする

あなたはポイントカードに、今、何ポイントたまっているのかが気になりました。 
レシートの数が多いので、手で計算するのは大変です。

早速、これを計算するプログラムを書きましょう。 
ただし、今月のはじめには全くポイントがたまっておらず（0 ポイント）、
また、今月中ポイントは消費されなかったものとします。
"""

# レシートの数を定義する
import sys
times = int(input())


# レシートの数だけ繰り返し文を使用する
total_points = 0
for i in range(times):
    # 日付と、価格を定義する
    day, price = input().split()
    
    # 今までは全ての日にちを記述していたが、日にちに指定した数値が含まれるという条件に変更する。
    if "5" in day:
        add_point = int(price) * 5 / 100
        total_points += int(add_point)
        
    elif "3" in day:
        add_point = int(price) * 3 / 100
        total_points += int(add_point)
        
    else:
        add_point = int(price) * 1 / 100
        total_points += int(add_point)
        
        
# 合計のポイントを出力する
print(total_points)


