"""
変化し続ける株価の様子を知るために、始値、終値、高値、安値と呼ばれる 4 種類の株価がしばしば用いられます。

1 日間の 4 種類の株価はそれぞれ次のように定められます。

・始値は 1 日の最初の株価
・終値は 1 日の最後の株価
・高値は 1 日の最大の株価
・安値は 1 日の最小の株価

さらに、n 日間の 4 種類の株価はそれぞれ次のように定められます。

・始値は 1 日目の始値
・終値は n 日目の終値
・高値は 1 日目から n 日目までの最大の高値
・安値は 1 日目から n 日目までの最小の安値


4 種類の株価が 1 日目から順に n 日間分与えられるので、n 日間の 4 種類の株価を求めるプログラムを作成してください。
"""

# 1、日にちを定義する
days = int(input())


# 2、初期値を定義する。今回の数値は1~100万の範囲なので、これでOK。
start = 1
end = 1
high = 1
low = 1000000


# 3、日にちの数だけ、繰り返し処理を行い、4つの数値を求める。
for i in range(days):
    s_price, e_price, h_price, l_price = map(int, input().split())
    #  1日目の始値と最終日の終値を定義する
    if i == 0: start = s_price
    if i == days - 1: end = e_price
    
    
    # 最大値と最小値を求める
    if high <= h_price: high = h_price
    if low >= l_price: low = l_price


# 4、結果を出力する
print(start, end, high, low)

