"""
英単語のテストの採点ではどこまでをスペルミスとみなしてどこまでを別の単語とみなすかが悩みどころです。
そこで paiza 予備校では以下の様な採点基準を導入してこれに従って厳密に採点することにしています。

・正解の単語と完全一致→ ◯ 2 点
・正解の単語と長さ(文字数)が異なる→ × 0 点
・正解の単語と長さは同じだが 1 文字だけ異なる→ △ 1 点
・正解の単語と長さは同じだが 2 文字以上異なる→ × 0 点

ここで「文字が異なる」とは、同じ位置にある文字が異なるということを意味しています。

例)
正解: apple, 解答: aple → 0 点 (長さが異なる)
正解: orange, 解答: olange → 1 点 (長さは同じだが 1 文字だけ異なる)
正解: grape, 解答: glepe → 0 点 (長さは同じだが 2 文字異なる)
正解: lemon, 解答: lemon → 2 点 (完全一致)

合計得点 → 3 点

問題数と各問題の正解の単語および生徒の解答が与えられるので、
このような形で paiza 予備校の採点基準に従いこの生徒の合計得点を算出してください。
"""

# 単語数を定義する
number = int(input())


# 単語数の数だけ、ループ処理をする
total = 0
for i in range(number):
    A, B = input().split()
    
    # 単語の状態で、点数を追加する
    if A == B:
        # 完全一致なら、2点
        total += 2
        
    elif len(A) != len(B):
        # 長さが違うなら、0点
        total += 0
        
    elif len(A) == len(B):
        # 長さが同じだけなら、それぞれの文字を調査する
        A_split = list(A)
        B_split = list(B)
        
        # 文字を1つずつ調査し、1文字違うごとに1ポイント減らす。
        hp = 2
        for j in range(len(A)):
            if A_split[j] != B_split[j]:
                hp -= 1
        
        # 0点と調査結果の大きい方を足す。
        total += max(hp, 0)

# 合計の点数を出力する
print(total)

