"""
あなたはとあるゲーム大会の事務係になりました。あなたの仕事は各試合の結果報告をまとめ、
勝敗の結果がひと目で分かる表をつくることです。これを自動化するプログラムをつくりましょう。


この大会は総当りのリーグ戦なのですべての参加者どうしが試合を行います。
なお、このゲームに引き分けは存在しません。


参加者の数と各試合の結果の情報が与えられるので、
上のような表の内部 (参加者番号を除いた部分) を出力してください。
"""

# チームの数を定義する
team = int(input())
    
# 出力用の初期データを作成する
# 配列名 = [["埋める"] * width for _ in range(height)]
sheet = [["-"] * team for _ in range(team)]
    
        
# 試合の数を計算し、使用する
match = team * (team - 1) // 2;
for i in range(match):
    # インデックス番号に対応しながら、勝敗結果を更新する
    win, lose = map(int, input().split())
    sheet[win - 1][lose - 1] = "W"
    sheet[lose - 1][win - 1] = "L"
    
# 最終結果を出力する
for S in sheet: print(" ".join(S))
    