"""
あなたは検索サイトを作成するエンジニアです。
この検索サイトでは便宜上、検索結果の件数を n 件としたとき、各検索結果は表示順に 1 から n まで番号付けられているとします。

今日のあなたの仕事はページネーションを実装することです。
ページネーションとは、大量に得られた検索結果を「ページサイズ」と呼ばれるサイズ毎に区切ることで、
検索結果を複数のページに分割して表示する機能です。

例えば、検索結果が 34 件であり、ページサイズが 10 件/ページとすると
これらの検索結果はページ 1 からページ 4 までの 4 枚のページに分割され、
各ページに表示される検索結果の番号は以下のようになります。

・ページ 1: 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
・ページ 2: 11, 12, 13, 14, 15, 16, 17, 18, 19, 20
・ページ 3: 21, 22, 23, 24, 25, 26, 27, 28, 29, 30
・ページ 4: 31, 32, 33, 34

検索結果の件数 n、ページサイズ s および表示したいページ番号 p が入力されるので、
ページ p に表示される検索結果の番号を昇順に全て出力するプログラムを作成してください。
ただし、ページ p に表示される検索結果が 1 つも存在しない場合は "none" と出力してください。
"""

# 全体のページ数、1ページの数、表示したいページ番号を定義する
N, S, P = map(int, input().split())

# 表示したい最初のページ = 1ページの数 × (表示したいページ番号 - 1) + 1
left = S * (P - 1) + 1

# 表示したい最後のページ = 表示したい最初のページ - 1 + 1ページの数
right = left - 1 + S


# 出力データを作成する。
output = []
for i in range(S):
    current = i + left
    
    # 全体のページ数より大きい時は追加しないことで、ページが多くなることを防ぐ。
    if current <= N:
        output.append(i + left)
        

# 条件に沿って出力する
if len(output) > 0:
    print(" ".join(map(str, output)))
else:
    print("none")
    
    