"""
あなたがよく利用しているコーヒーショップは本日限定であるサービスを行っています。
・コーヒーをお買い上げした際に、次のお買い上げの値段を更に P% off!
・毎回の値下げにおいて小数点以下切り捨て


あなたは値下げが累積する事に目をつけました。
コーヒーを何回も飲んでいれば、タダでコーヒーを飲めるようになるのです。

タダで頼みたいあなたは、何円払えば以後タダで注文できるのか計算したくなりました。
実際にプログラムを書いて計算してみましょう。
"""

# 最初の価格、割引率を定義する
price, discount = map(int, input().split())


# 合計金額、現在のコーヒーの価格を定義する
total = 0
current = price


# current(現在のコーヒーの金額が0になるまで処理)
while current > 0:
    # 1、コーヒーを買う。
    total += current
    
    # 2、次回の金額を求める。次回の金額は小数点以下切り捨て。
    sub = current * discount / 100
    current = int(current - sub)

# 合計の金額を求める。
print(total)

