"""
フライト中に退屈してしまったあなたは、持っているトランプを使用した簡単な遊びを考えました。

この遊びでは 1 から 9 までの数字のカードのみを 4 枚使用します。
ただし、この 4 枚の中で同じ数値のカードが重複する事もあります。
ルールは以下の通りです。

4 枚のカードを横に並べます。
左から 2 枚のカード、右から 2 枚のカードをそれぞれ 2 ケタの整数とみなし、和を計算します。
あらゆる並べ方を試し、和の最大値（最大スコア）を求めます。

カード 4 枚に書かれた数が与えられるので、最大スコアを出力してください。
入力例 1 の 2, 9, 3, 8 の 4 枚を使う場合、以下の 12 通りの和の最大値 175 が最大スコアとなります。

カードの 4 枚の並べ方は 4! = 24 通り存在しますが、足し算は順序に依存しないため、12 通りのみ考慮すればよいことに注意してください。
たとえば、9, 2, 3, 8 の順で並べた場合のスコアは 92 + 38 = 130 となります。
"""

# 入力を数値の配列にする。
numbers = list(map(int, input().split()))

# 配列をコピーして、降順(大→小)にする。
sorted_numbers = numbers.copy()
sorted_numbers.sort(reverse = True)

# 数値を2つ作成する。今回は大きい数値2つを10倍することで、最大値を取得することができる。
A = sorted_numbers[0] * 10 + sorted_numbers[2]
B = sorted_numbers[1] * 10 + sorted_numbers[3]

# 合計を計算し、出力する。
total = A + B
print(total)

