"""
あなたは今辞書作成の業務に取り組んでいます。

辞書に載る各単語は小文字のアルファベット("a", "b", ..., "z")のみで構成されており、
また、辞書 1 ページにつき K 個の単語が掲載されます。
また、普通の辞書と同じように、単語は辞書順で小さいほうから掲載されていきます。

単語 S が単語 T より辞書順で小さいとは、ある整数 i について、
S と T の i 番目までの文字がすべて等しく、かつ S に i+1 番目の文字がないか、
S の i+1 番目の文字より T の i+1 番目の文字のほうがアルファベット順で後ろにあることを言います。
例えば、"a" よりも "aa" のほうが辞書順で後ろであり、"abc" よりも "z" のほうが辞書順で後ろであり、
"def" よりも "det" のほうが辞書順で後ろです。

あなたは、この辞書の P ページ目にどの単語が載るのか気になりました。
辞書に掲載する N 個の単語および 1 ページに載る単語の数 K および整数 P が与えられるので、
P ページ目に載る単語のリストを求めてください。

1 ページに K 個の単語が載らない場合があることに注意してください。

"""
# 入力 → 変数に変換する
word_int, one_page, pages = list(map(int, input().split()))
words = input().split()

# 文字列の配列に対してソートすると、辞書と同じ順になる。
sorted_words = words[::1]
sorted_words.sort()

# 開くページの最初と最後を調べる。
start = one_page * (pages - 1)
end = start + one_page

# 単語が存在するとき、出力する
for i in range(start, end):
    if(i < word_int): print(sorted_words[i])


