"""
あなたは子どもたちの算数の勉強を見ています。 子どもたちは足し算をするとき、
指で数えて足し算するので繰り上がりの計算ができません。 
しかし、あなたは子どもたちに甘いので、その計算結果でも正解にすることにしました。

整数が 2 つ与えられるので子どもたちの計算方法で計算した結果を出力するプログラムを作成してください。
ただし、入力例 2 のように先頭の数が 0 となった場合でも省略せずに 0 を出力してください。


入力される値
入力は以下のフォーマットで与えられます。

A B
・足し算に用いる整数 A, B がこの順に半角スペース区切りで与えられます。
入力は 1 行となり、末尾に改行が 1 つ入ります。


期待する出力
繰り上がりを無視して A と B を足した結果を出力してください。
出力は A と B の大きい方の桁数に合わせてください。

末尾に改行を入れ、余計な文字、空行を含んではいけません。


"""
# 入力 → 変数に変換する
A, B = input().split()

# 後で桁数がずれることを防ぐために、元々桁数が違うときは、0で埋める。
if (len(A) != len(B)):
    max_length = max(len(A), len(B))
    
    # 変数.zfill(桁数)で左から不足分を0で埋めることができる。
    A = A.zfill(max_length)
    B = B.zfill(max_length)


# 計算を行う。%10することで、10の位を無視できる。
result = [];
for i in range(len(A)):
    total = int(A[i]) + int(B[i])

    add_number = total % 10
    result.append(add_number);


# くっつけて出力する。
output = "".join(map(str, result))
print(output)

