"""
あなたは友達に勧められて、とあるカードゲームを始めることにしました。
そのカードゲームには、カード番号 1 から M までの M 種類のカードがあります。
あなたは完璧主義者なので、どうしても M 種類全てのカードが欲しくなり、カードを N 枚買いました。

さあ、買ってきた N 枚のカードを順番に開けていきましょう!

開けたカードのカード番号が順番に与えられるので、M 種類そろったのは何枚開けたときかを出力するプログラムを書いて下さい。


入力される値
入力は以下のフォーマットで与えられます。
N M
c_1
...
c_N
・1 行目に買ったカードの枚数 N とカードの種類数を示す整数 M が入力されます。
・続く N 行に開けたカードのカード番号 c_i (1 ≦ i ≦ N) が入力されます。
・最終行の末尾に改行が 1 つ入ります。
それぞれの値は文字列で標準入力から渡されます。


期待する出力
何枚開けたときに全種類そろったかを出力してください。
ただし、全て開けても全種類そろわないときは、"unlucky" と出力してください。
期待する出力は 1 行からなります。
最後は改行し、余計な文字、空行を含んではいけません。



条件
すべてのテストケースにおいて、以下の条件をみたします。
・1 ≦ N ≦ 1000
・1 ≦ M ≦ 100
・1 ≦ c_i ≦ M (1 ≦ i ≦ N)


入力例1
6 3
1
2
2
3
1
3


出力例1
4


入力例2
7 4
1
2
3
1
2
3
1


出力例2
unlucky


入力例3
1 100
1


出力例3
unlucky

"""
# 入力 → 変数に変換する
buy, cards_int = map(int, input().split())
cards = []
for i in range(buy):
    card = int(input())
    cards.append(card)

# カードリストを作成する。ここは全てtrue(持っている)になったら買ったカードが余っていても、強制終了する。
cardList = [False] * cards_int

# カードを引く必要があるかの変数を付け、カードを引く。
open_check = True
for j in range(len(cards)):
    # カードを引いて持っているかチェックする。
    card = cards[j] - 1
    if(cardList[card] == False):
        cardList[card] = True

    # 全てカードがそろっているかチェックする。
    check = all(cardList)
    if(check):
        print(j + 1);
        open_check = False
        break


# もし、最後まで、カードを全て引けないと、unluckyを出力する。
if(open_check):
    print("unlucky")

