"""
あなたはしりとりアプリを作っています。
まず、手始めに同じ単語が出たかどうかは考慮せず2つの単語からしりとりを
ミスしたかどうかを判定する部分を作ることにしました。

先に出た単語 A とそれに続く単語 B がそれぞれ入力されます。
単語は必ず半角アルファベット小文字で構成された文字列です。
また、単語 A の最後の 1 文字は "n" ではないとします。


以下のルールを満たす時は "OK" そうでない場合は "NG" と出力する
プログラムを作成してください。

・A の最後の 1 文字が B の最初の 1 文字と一致している。
・B の最後の 1 文字が "n" ではない。

"""

# 入力 → 変数に変換する
A = list(input())
B = list(input())


# 条件の1つ最後の文字を定義する
B_list = B[len(B) - 1]


# ルールに違反していないかチェックし、出力する
check = True
if A[len(A) - 1] != B[0] or B_list == "n":
    check = False
    
print("OK" if check else "NG")

