"""
あなたは整数を足して 21 を目指すゲームをプレイするプログラムを作成しています。

そのゲームでは、はじめに 2 つの数字を受け取り、更に数字を受け取るかどうかの判断をします。
受け取る場合は "HIT" 、受け取らない場合は "STAND" と出力するルールになっています。

以下のルールで "HIT" もしくは "STAND" を出力するプログラムを作成してください。

・2つの数字の合計が 16 未満であれば "HIT"
・2つの数字の合計が 16 以上であれば "STAND"

"""

# 入力 → 変数に変換する
import sys
numbers = list(map(int, sys.stdin.read().split()))


# インデックス番号のままでもいいが、わかりやすく計算するために変数に変換
A = numbers[0]
B = numbers[1]
total = A + B
limit = 16

# カードを引くか、引かないか分岐。本来のルールでは、A = 1 or 11、JQK = 10、数値 = そのままだが、今回は無視。
if total >= limit:
    print("STAND")
else:
    print("HIT")
