"""
あなたはあるイベントを主催していて、参加者の一人にゲストのサイン入り
の本をプレゼントしようとしています。
公平を期すため、じゃんけんでプレゼントする人を決めようとしていますが、
数が多いため通常のじゃんけんでは決着がつきません。

そこで、じゃんけんをして、最も同じ手の人が少なかった手を出した人をひとまず勝者と
することにしました。ただしこのじゃんけんでは、グーおよびパーしか出すことができません。

勝った人はどちらの手を出していたか求めるプログラムを作成してください。
ただし、どちらの手も出している人の数が同じ場合は引き分けとなります。

"""

# 入力 → 変数に変換する。
import sys
number = int(input())
hands = sys.stdin.read().split()

# じゃんけんの手をカウントする
count_G = 0
count_P = 0
for H in hands:
    if H == "G":
        count_G += 1
    elif H == "P":
        count_P += 1
        
        
# 条件に沿って出力する
if count_G == count_P:
    print("Draw")
elif count_G > count_P:
    print("P")
elif count_G < count_P:
    print("G")

