"""
クリスマスといえば 12 月 25 日ですが、キリスト教で用いられる教会暦では、
厳密には 12 月 25 日のすべてがクリスマスに属するわけではありません。

教会暦では、日没から次の日没までを一日として扱うので、
クリスマスは厳密には 12 月 24 日の日没から 12 月 25 日の日没までとなります。

12 月 25 日の日没の時刻および 25 日現在のある時刻が与えられるので、
25 日の現在時刻はクリスマスかどうか判定するプログラムを作成してください。
"""

# 入力 → 変数に変換する。
sunset = input().split()
current = input().split()


# 計算し、処理を簡単にする。時間を分に変換することで条件を1つにする
sunset_time = int(sunset[0]) * 60 + int(sunset[1])
current_time = int(current[0]) * 60 + int(current[1])


# 条件に沿って出力する
print("Yes" if current_time <= sunset_time else "No")
    
